package org.itstep.qa.home.array;

import java.util.Arrays;

public class ArrayOnTen {
    /*Напишите метод, увеличивающий элементы массива на 10%. Определите, какие у этого метода входные и выходные данные.
     Решите сами, должен ли метод изменять исходный массив, или в результате работы будет создаваться новый.
      */

    public void getArrayIncreaseOnTen(int [] array){
        for(int i = 0; i < array.length; i++){
            //System.out.println(array[i] + " ");
        }
        System.out.println(Arrays.toString(array));
    }
}
